/* 信04 2252941 杨瑞灵 */
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
/* ----具体要求----
   1、允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   ---------------------------------------------------------------------
*/

/***************************************************************************
  函数名称：
  功    能：给定x，返回 y=2x^3-9x^2+12-3的值
  输入参数：
  返 回 值：
  说    明：函数名为f，返回值、输入参数自行定义
***************************************************************************/
double f(double x)
{
	double y;
	y = 2 * x * x * x - 9 * x * x + 12 * x - 3;
	return y;
}

/***************************************************************************
  函数名称：
  功    能：求方程y=2x^3-9x^2+12-3在[0..1]之间的根
  输入参数：
  返 回 值：
  说    明：调用f函数求各y=f(x)的值
***************************************************************************/
double fun(double x1, double x2)
{
	double x, y;
	double l, r;
	l = x1, r = x2;
	x = (l + r) / 2.0;
	y = f(x);

	while ((y > 1e-6) || (y < -1e-6))
	{
		if (y >= 0)
		{
			r = x;
			x = (l + r) / 2.0;
		}
		else
		{
			l = x;
			x = (l + r) / 2.0;
		}
		y = f(x);
	}
	return x;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main只允许修改...位置的内容
***************************************************************************/
int main()
{
	double x = fun(0, 1);
	/* 打印方程在[0..1]之间的根 */
	printf("x=%.3f\n",x);
	return 0;
}
